In [1]:
import pandas as pd

In [35]:
df = pd.read_csv("titanic.csv")
df =df.dropna()

In [36]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [37]:
use_df = df[['PassengerId','Survived','Sex','Age','Fare']]

In [38]:
use_df.head()

    PassengerId  Survived     Sex   Age     Fare
1             2         1  female  38.0  71.2833
3             4         1  female  35.0  53.1000
6             7         0    male  54.0  51.8625
10           11         1  female   4.0  16.7000
11           12         1  female  58.0  26.5500

In [39]:
inputs = use_df.drop('Survived',axis='columns')
inputs.head()

    PassengerId     Sex   Age     Fare
1             2  female  38.0  71.2833
3             4  female  35.0  53.1000
6             7    male  54.0  51.8625
10           11  female   4.0  16.7000
11           12  female  58.0  26.5500

In [40]:
outputs = use_df['Survived']
outputs.head()

1     1
3     1
6     0
10    1
11    1
Name: Survived, dtype: int64

In [41]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()

In [42]:
inputs['Sex_n'] = le_sex.fit_transform(inputs['Sex'])

In [43]:
inputs.head()

    PassengerId     Sex   Age     Fare  Sex_n
1             2  female  38.0  71.2833      0
3             4  female  35.0  53.1000      0
6             7    male  54.0  51.8625      1
10           11  female   4.0  16.7000      0
11           12  female  58.0  26.5500      0

In [44]:
inputs = inputs.drop('Sex',axis = 'columns')

In [45]:
inputs.head()

    PassengerId   Age     Fare  Sex_n
1             2  38.0  71.2833      0
3             4  35.0  53.1000      0
6             7  54.0  51.8625      1
10           11   4.0  16.7000      0
11           12  58.0  26.5500      0

In [46]:
from sklearn.model_selection import train_test_split
inputs_train, inputs_test, outputs_train, outputs_test = train_test_split(inputs, outputs, test_size=0.3)

In [47]:
inputs_train.shape

(128, 4)

In [48]:
inputs_test.shape

(55, 4)

## Decision tree

In [49]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()
model.fit(inputs_train,outputs_train)

DecisionTreeClassifier()

In [50]:
pred = model.predict(inputs_test)
pred

array([1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1,
       0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1,
       1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1], dtype=int64)

In [52]:
outputs_test

853    1
183    1
583    0
54     0
366    1
823    1
218    1
505    0
215    1
257    1
205    0
445    1
370    1
745    0
291    1
523    1
434    0
632    1
66     1
763    1
268    1
318    1
174    0
177    0
307    1
252    0
305    1
690    1
331    0
124    0
473    1
536    0
835    1
724    1
11     1
879    1
341    1
390    1
23     1
310    1
438    0
730    1
707    1
662    0
641    1
327    1
10     1
789    0
716    1
453    1
496    1
659    0
275    1
329    1
540    1
Name: Survived, dtype: int64

In [54]:
from sklearn.metrics import accuracy_score
accuracy_score(outputs_test, pred)

0.7636363636363637

In [55]:
from sklearn.metrics import confusion_matrix
confusion_matrix(outputs_test, pred)

array([[10,  6],
       [ 7, 32]], dtype=int64)